# ChangeSize Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationNetworkChangeService..::..ChangeSize Method
FabricationNetworkChangeService Class See Also
---
Changes the size of the selection of fabrication parts.
**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.2
# Syntax
C#
---
```text
public FabricationNetworkChangeServiceResult ChangeSize(
	ISet<ElementId> selection,
	ISet<FabricationPartSizeMap> fabricationPartSizeMaps
)
```

Visual Basic
---
```text
Public Function ChangeSize ( _
	selection As ISet(Of ElementId), _
	fabricationPartSizeMaps As ISet(Of FabricationPartSizeMap) _
) As FabricationNetworkChangeServiceResult
```

Visual C++
---
```text
public:
FabricationNetworkChangeServiceResult ChangeSize(
	ISet<ElementId^>^ selection,
	ISet<FabricationPartSizeMap^>^ fabricationPartSizeMaps
)
```

# ### Parameters
selection
    Type: System.Collections.Generic..::..ISet<(Of <(<'ElementId>)>)> The set of element identifiers of fabrication parts to change the size for.
fabricationPartSizeMaps
    Type: System.Collections.Generic..::..ISet<(Of <(<'FabricationPartSizeMap>)>)> The map containing the original sizes for the straights to the new sizes.
# Remarks
After this method has been invoked, call:
  * GetStraightsThatWereNotChanged()()()() to get a set of fabrication part straight element identifiers that were not changed.
  * GetElementsThatFailed()()()() to get a set of fabrication part element identifiers that had failures.

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The selection contains invalid elements to change. -or- The fabrication size map is empty. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | No fabrication configuration is loaded. |

# See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace